app/views/jornadas/index.html.erb

SELECT  "dependientes".* FROM "dependientes" WHERE "dependientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <td><%= jornada.fecha %></td>
      <td><%= Dependiente.find(jornada.dependiente).nombre  %></td>