app/views/jornadas/show.html.erb

SELECT  "dependientes".* FROM "dependientes" WHERE "dependientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Dependiente:</strong>
  <%= Dependiente.find(@jornada.dependiente).nombre %>

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <tr>
      <td><%= link_to Product.find(mercancium.product).nombre, Product.find(mercancium.product) %></td>