app/controllers/dependientes_controller.rb

  def index
    @dependientes = Dependiente.all
---
SELECT "dependientes".* FROM "dependientes"

  def create
    @dependiente = Dependiente.new(dependiente_params)

    respond_to do |format|
      if @dependiente.save
---
INSERT INTO "dependientes" ("nombre", "direccion", "telefono", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Susana Martinez Benitez"], ["direccion", "............................"], ["telefono", 55110855], ["created_at", 2018-05-24 03:46:00 UTC], ["updated_at", 2018-05-24 03:46:00 UTC]]

    def set_dependiente
      @dependiente = Dependiente.find(params[:id])
---
SELECT  "dependientes".* FROM "dependientes" WHERE "dependientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]