app/controllers/jornadas_controller.rb

SELECT "jornadas".* FROM "jornadas"
---
  def index
    @jornadas = Jornada.all

SELECT  "jornadas".* FROM "jornadas" WHERE "jornadas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @jornadas = Jornada.find(params[:id])

INSERT INTO "jornadas" ("fecha", "fondo_inicial", "fondo_final", "dependiente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @jornada = Jornada.new(jornada_params)

    respond_to do |format|
      if @jornada.save

UPDATE "jornadas" SET "fondo_final" = ?, "updated_at" = ? WHERE "jornadas"."id" = ?  [["fondo_final", #<BigDecimal:7f9b54035768,'0.77112E5',9(18)>], ["updated_at", 2018-07-17 21:30:14 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @jornada.update(jornada_params)

SELECT  "jornadas".* FROM "jornadas" WHERE "jornadas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_jornada
      @jornada = Jornada.find(params[:id])