app/controllers/products_controller.rb

INSERT INTO "products" ("nombre", "descripcion", "foto", "precio", "medicion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "descripcion" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["descripcion", "La pasta es de atun y aceitunas"], ["updated_at", 2018-05-30 22:08:05 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)