app/views/mercancia/index.html.erb

      <tr>
        <td><%= Product.find(mercancium.product).nombre  %></td>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]