app/views/mercancia/show.html.erb

  <strong><%= link_to 'Producto:', @mercancium.product %></strong>
  <%= Product.find(@mercancium.product).nombre  %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  <strong><%= link_to 'Jornada:', @mercancium.jornada %></strong>
  <%= Jornada.find(@mercancium.jornada).fecha  %>
---
SELECT  "jornadas".* FROM "jornadas" WHERE "jornadas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]